app/views/posts/_all_posts.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["post_id", 12], ["user_id", 3], ["LIMIT", 1]]
---
      <p class="post_title"><%= post.title %></p>
      <% liked = Like.find_by(post_id: post.id, user_id: current_user.id) %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 12]]
---
      <% end %>
      <p id="number_likes" class="like_value_<%= post.id%>"><%=post.likes.count%></p>