app/views/posts/index.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["post_id", 2], ["user_id", 3], ["LIMIT", 1]]
---
    <%= image_tag(post.image) %>
    <% liked = Like.find_by(post_id: post.id, user_id: current_user.id) %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 2]]
---
    <% end %>
  <p class="like_value_<%= post.id%>"><%=post.likes.count%></p>