app/controllers/likes_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["post_id", 2], ["user_id", 3], ["LIMIT", 1]]
INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["user_id", 3], ["created_at", "2018-09-29 17:47:46.742040"], ["updated_at", "2018-09-29 17:47:46.742040"]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
  def create
    post = Post.find(params[:post_id])
    if !!current_user
      liked = Like.find_by(post_id: post.id, user_id: current_user.id)

      if !liked
        like = Like.create(post_id: post.id, user_id: current_user.id)
      else
        liked.destroy