app/controllers/posts_controller.rb

  def index
    @posts = Post.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def create
    post = Post.create(message_params)
---
INSERT INTO "posts" ("created_at", "updated_at", "title", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2018-09-29 19:55:37.895277"], ["updated_at", "2018-09-29 19:55:37.895277"], ["title", "Bohinj lake"], ["user_id", 3]]

  def user
    user = User.find( current_user.id )
    @posts = Post.where(user_id: current_user.id).order(created_at: :desc)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 3]]